app/Controllers/Admin/BagiHasil.php

            ->getResultArray();

        // Ambil data franchise untuk dropdown filter
        $data['franchise_list'] = $db->table('franchise')->get()->getResultArray();
---
SELECT *
FROM `franchise`