app/Controllers/Admin/Bahan.php

    public function index()
    {
        $db = \Config\Database::connect();

        $data['bahan'] = $db->table('bahan_baku')
            ->get()
            ->getResultArray();
---
SELECT *
FROM `bahan_baku`