app/Controllers/Admin/Franchise.php

    public function index()
    {
        $model = new FranchiseModel();

        $data['franchise'] = $model->findAll();
---
SELECT *
FROM `franchise`