app/Controllers/Admin/Pemesanan.php

SELECT `p`.*, `f`.`nama_cabang`, `b`.`nama_bahan`
FROM `pemesanan_bahan` `p`
JOIN `franchise` `f` ON `f`.`id_franchise` = `p`.`id_franchise`
JOIN `bahan_baku` `b` ON `b`.`id_bahan` = `p`.`id_bahan`
---
    public function index()
    {
        $db = \Config\Database::connect();

        $data['pesanan'] = $db->table('pemesanan_bahan p')
            ->select('p.*, f.nama_cabang, b.nama_bahan')
            ->join('franchise f', 'f.id_franchise = p.id_franchise')
            ->join('bahan_baku b', 'b.id_bahan = p.id_bahan')
            ->get()
            ->getResultArray();

UPDATE `pemesanan_bahan` SET `status` = 'ditolak'
WHERE `id_pemesanan` = '7'
---
    public function tolak($id)
    {
        $db = \Config\Database::connect();

        $db->table('pemesanan_bahan')
            ->where('id_pemesanan', $id)
            ->update([
                'status' => 'ditolak'
            ]);