app/Controllers/Admin/User.php

    public function index()
    {
        $db = \Config\Database::connect();

        // Ambil data user dengan role mitra beserta info franchisenya
        $data['users'] = $db->table('user u')
            ->select('u.*, f.nama_cabang, f.pemilik')
            ->join('franchise f', 'f.id_franchise = u.id_franchise', 'left')
            ->where('u.role', 'mitra')
            ->orderBy('u.id_user', 'DESC')
            ->get()
            ->getResultArray();
---
SELECT `u`.*, `f`.`nama_cabang`, `f`.`pemilik`
FROM `user` `u`
LEFT JOIN `franchise` `f` ON `f`.`id_franchise` = `u`.`id_franchise`
WHERE `u`.`role` = 'mitra'
ORDER BY `u`.`id_user` DESC