app/Controllers/Login.php

    public function proses()
    {
        $db = \Config\Database::connect();

        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');

        $user = $db->table('user')
            ->where('username', $username)
            ->get()
            ->getRowArray();
---
SELECT *
FROM `user`
WHERE `username` = 'admin'