app/Controllers/Mitra/Dashboard.php

    public function index()
    {
        $db = \Config\Database::connect();
        $id_franchise = session()->get('id_franchise');

        // TOTAL PENJUALAN
        $row_total = $db->table('penjualan')
            ->selectSum('total')
            ->where('id_franchise', $id_franchise)
            ->get()
            ->getRow();

        $total_penjualan = $row_total ? ($row_total->total ?? 0) : 0;

        // TOTAL PESANAN
        $total_pesanan = $db->table('pemesanan_bahan')
            ->where('id_franchise', $id_franchise)
            ->countAllResults();

        // BAGI HASIL
        $bagian_mitra = $total_penjualan * 0.8;
        $bagian_pusat = $total_penjualan * 0.2;

        // PIE CHART PRODUK TERLARIS
        $produk = $db->table('detail_penjualan d')
            ->select('p.nama_produk, SUM(d.qty) as total')
            ->join('produk_jamu p', 'p.id_produk = d.id_produk')
            ->join('penjualan pj', 'pj.id_penjualan = d.id_penjualan')
            ->where('pj.id_franchise', $id_franchise)
            ->groupBy('d.id_produk')
            ->get()
            ->getResultArray();
---
SELECT SUM(`total`) AS `total`
FROM `penjualan`
WHERE `id_franchise` = '4'
SELECT COUNT(*) AS `numrows`
FROM `pemesanan_bahan`
WHERE `id_franchise` = '4'
SELECT `p`.`nama_produk`, SUM(d.qty) as total
FROM `detail_penjualan` `d`
JOIN `produk_jamu` `p` ON `p`.`id_produk` = `d`.`id_produk`
JOIN `penjualan` `pj` ON `pj`.`id_penjualan` = `d`.`id_penjualan`
WHERE `pj`.`id_franchise` = '4'
GROUP BY `d`.`id_produk`

        }

        // GRAFIK OMSET BULANAN
        $grafik = $db->table('penjualan')
            ->select("DATE_FORMAT(tanggal,'%Y-%m') as bulan, SUM(total) as total")
            ->where('id_franchise', $id_franchise)
            ->groupBy("DATE_FORMAT(tanggal,'%Y-%m')")
            ->orderBy('bulan','ASC')
            ->get()
            ->getResultArray();
---
SELECT DATE_FORMAT(tanggal, '%Y-%m') as bulan, SUM(total) as total
FROM `penjualan`
WHERE `id_franchise` = '4'
GROUP BY DATE_FORMAT(tanggal, '%Y-%m')
ORDER BY `bulan` ASC