app/Controllers/Mitra/Penjualan.php

SELECT *
FROM `penjualan`
WHERE `id_franchise` = '4'
ORDER BY `tanggal` DESC
SELECT DATE_FORMAT(tanggal, '%Y-%m') as bulan, SUM(total) as total
FROM `penjualan`
WHERE `id_franchise` = '4'
GROUP BY DATE_FORMAT(tanggal, '%Y-%m')
ORDER BY `bulan` ASC
---
    public function index()
    {
        $db = \Config\Database::connect();
        $idFranchise = session()->get('id_franchise');

        $bulan = $this->request->getGet('bulan');

        $builder = $db->table('penjualan')
            ->where('id_franchise', $idFranchise);

        // FILTER BULAN
        if ($bulan) {
            $builder->where("DATE_FORMAT(tanggal,'%Y-%m')", $bulan);
        }

        // DATA TABEL
        $data['penjualan'] = $builder
            ->orderBy('tanggal', 'DESC')
            ->get()
            ->getResultArray();

        // GRAFIK
        $grafik = $db->table('penjualan')
            ->select("DATE_FORMAT(tanggal,'%Y-%m') as bulan, SUM(total) as total")
            ->where('id_franchise', $idFranchise)
            ->groupBy("DATE_FORMAT(tanggal,'%Y-%m')")
            ->orderBy('bulan','ASC')
            ->get()
            ->getResult();

SELECT *
FROM `produk_jamu`
---
    public function tambah()
    {
        $db = \Config\Database::connect();

        $data['produk'] = $db->table('produk_jamu')->get()->getResultArray();

SELECT *
FROM `produk_jamu`
WHERE `id_produk` = '8'
---
    public function simpan()
    {
        $db = \Config\Database::connect();

        $produk = $this->request->getPost('produk');
        $qty    = $this->request->getPost('qty');
        $tanggal = $this->request->getPost('tanggal');

        $idFranchise = session()->get('id_franchise');

        // VALIDASI DASAR
        if (!$produk || !$qty || !$tanggal) {
            return redirect()->back()->with('error', 'Data tidak lengkap');
        }

        $total = 0;

        // HITUNG TOTAL
        foreach ($produk as $i => $idProduk) {

            if (empty($idProduk) || empty($qty[$i])) continue;

            $dataProduk = $db->table('produk_jamu')
                ->where('id_produk', $idProduk)
                ->get()
                ->getRowArray();

INSERT INTO `penjualan` (`tanggal`, `id_franchise`, `total`) VALUES ('2026-04-07', '4', 800000)
---
        }

        // INSERT HEADER PENJUALAN
        $db->table('penjualan')->insert([
            'tanggal'       => $tanggal,
            'id_franchise'  => $idFranchise,
            'total'         => $total
        ]);

SELECT *
FROM `produk_jamu`
WHERE `id_produk` = '8'
INSERT INTO `detail_penjualan` (`id_penjualan`, `id_produk`, `qty`, `harga`) VALUES (22, '8', '80', '10000')
---

            if (empty($idProduk) || empty($qty[$i])) continue;

            $dataProduk = $db->table('produk_jamu')
                ->where('id_produk', $idProduk)
                ->get()
                ->getRowArray();

            if (!$dataProduk) continue;

            $db->table('detail_penjualan')->insert([
                'id_penjualan' => $idPenjualan,
                'id_produk'    => $idProduk,
                'qty'          => $qty[$i],
                'harga'        => $dataProduk['harga']
            ]);